---
kind: property
id: P:Autodesk.Revit.DB.ScheduleField.HorizontalAlignment
source: html/d204d391-a453-2793-db9e-1e30716edbaf.htm
---
# Autodesk.Revit.DB.ScheduleField.HorizontalAlignment Property

The horizontal alignment of the column's data.

## Syntax (C#)
```csharp
public ScheduleHorizontalAlignment HorizontalAlignment { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration